brew "aha"
brew "xz"
brew "ast-grep"
brew "autoconf"
brew "automake"
brew "readline"
brew "bash"
brew "bash-completion", link: false
brew "bash-completion@2"
brew "openssl@3"
brew "bat"
brew "bison"
brew "broot"
brew "glib"
brew "chruby"
brew "claude-squad"
brew "cmake"
brew "coreutils"
brew "curl"
brew "sqlite"
brew "deno"
brew "difftastic"
brew "eza"
brew "fastmod"
brew "fd"
brew "harfbuzz"
brew "libb2"
brew "libvorbis"
brew "opus"
brew "libsoxr"
brew "libvpx"
brew "rubberband"
brew "ffmpeg"
brew "ffmpeg@6"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "git-who"
brew "gnupg"
brew "libtool"
brew "graphviz"
brew "gzip"
brew "imagemagick"
brew "jj"
brew "jq"
brew "lazygit"
brew "lesspipe"
brew "libffi"
brew "libyaml"
brew "livekit"
brew "livekit-cli"
brew "llama.cpp"
brew "mactop"
brew "nasm"
brew "node"
brew "nvm"
brew "openjdk@21"
brew "pandoc"
brew "pipx"
brew "pkgconf"
brew "poppler"
brew "portaudio"
brew "pyenv"
brew "python-setuptools"
brew "python@3.12"
brew "repomix"
brew "ripgrep"
brew "rsync"
brew "ruby-install"
brew "sentencepiece"
brew "shellcheck"
brew "starship"
brew "tcl-tk@8"
brew "tectonic"
brew "tmux"
brew "tree"
brew "uv"
brew "watch"
brew "weasyprint"
brew "wget"
brew "yasm"
brew "yq"
brew "zlib"
cask "claude-code"
cask "mactex-no-gui"
cask "ngrok"
cask "quarto"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "dwtexe.cursor-stats"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "openai.chatgpt"
vscode "tomoki1207.pdf"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
